rottenpotatoes/app/controllers/movies_controller.rb

  def sameDirector
    @movie = Movie.find(params[:id])
    if (@movie.director)
      # puts "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAaaa"
      @movies = Movie.find_all_by_director(@movie.director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Mujtaba Ali Malik'